# Baseline ESOD (heat segmenter only, EDL OFF) — held-out 9-class 학습용
# EDL parallel evidence head (ev_pred)는 build에서 자동 생성되지만,
# ESOD_EDL_DET_LAMBDA=0 환경변수로 학습 신호 차단 → conf branch만 학습 (true baseline)
# parameters
nc: 10  # number of classes (held-out filter는 dataloader에서 적용)

depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
# anchors  1536
anchors:
  - [6,8,    10,22,  19,15]  # P3/8
  - [19,32,  39,22,  32,47]  # P4/16
  - [74,38,  65,74,  136,112]  # P5/32

# YOLOv5 backbone
backbone:
  [[-1, 1, Focus, [64, 3]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 9, C3, [256]],
   [-1, 1, DWConv, [256, 13, 1]],
   [[-1], 1, Segmenter, [1]],     # 6: plain heat segmenter (ESOD baseline, BCE)
   [[4, -1], 1, HeatMapParser, [256, 8, 0.5]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [3, 5, 7]]],
   [-1, 3, C3, [1024, False]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],

   [[20, 23, 26], 1, Detect, [nc, anchors]],
  ]
