# 3-C Role-separated dual: heat (closed-set easy) + edl (hard-region) — noisy-OR fusion
# - Heat branch: GT mask 그대로 학습 (BCE) — 기존 ESOD 강점
# - EDL branch:  heat이 약한 GT region 만 학습 (R-EDL) — hard/missed object specialize
# - Fusion: F = 1 - (1 - σ(heat)) * (1 - p_e_obj)  (noisy-OR)
# DualSegmenter 재사용 (gate output은 unused — 학습 신호 없음 → zero-init 유지)
nc: 10

depth_multiple: 0.67
width_multiple: 0.75
anchors:
  - [6,8,    10,22,  19,15]
  - [19,32,  39,22,  32,47]
  - [74,38,  65,74,  136,112]

backbone:
  [[-1, 1, Focus, [64, 3]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 9, C3, [256]],
   [-1, 1, DWConv, [256, 13, 1]],
   [[-1], 1, DualSegmenter, []],   # 6: role-dual (heat 1ch + edl 2ch + gate 1ch); gate unused
   [[4, -1], 1, HeatMapParser, [256, 8, 0.5]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [3, 5, 7]]],
   [-1, 3, C3, [1024, False]],
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],

   [[20, 23, 26], 1, Detect, [nc, anchors]],
  ]
